<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Filosofia || Ruby</title>
<style type="text/css">
<!--
body {
	background-color: #FBFBFB;
}
.style1 {	font-size: 24px;
	color: #800000;
}
.style2 {	font-size: 28px;
	color: #b22222;
	font-weight: bold;
}
.style4 {font-size: 24px; color: #000000; }
.style5 {font-size: 22px; color: #000000; font-style: italic; }
-->
</style></head>

<body>
<blockquote>
  <blockquote>
        <blockquote>
          <p class="style2">Filosof&iacute;a de Ruby </p>
          <p align="justify" class="style4">El creador  del lenguaje, <strong>Yukihiro &quot;Matz&quot; Matsumoto</strong>, ha dicho que Ruby est&aacute;  dise&ntilde;ado para la productividad y la diversi&oacute;n del desarrollador, siguiendo los  principios de una buena interfaz de usuario. Sostiene que el dise&ntilde;o de sistemas  necesita enfatizar las necesidades humanas m&aacute;s que las de la m&aacute;quina:</p>
          <blockquote>
            <p align="justify" class="style5">A menudo la  gente, especialmente los ingenieros en computaci&oacute;n, se centran en las m&aacute;quinas.  Ellos piensan, &quot;Haciendo esto, la m&aacute;quina funcionar&aacute; m&aacute;s r&aacute;pido. Haciendo  esto, la m&aacute;quina funcionar&aacute; de manera m&aacute;s eficiente. Haciendo esto...&quot;  Est&aacute;n centrados en las m&aacute;quinas, pero en realidad necesitamos centrarnos en las  personas, en c&oacute;mo hacen programas o c&oacute;mo manejan las aplicaciones en los  ordenadores. Nosotros somos los jefes. Ellos son los esclavos.</p>
          </blockquote>
          <p align="justify" class="style4">Se ha  supuesto que Ruby sigue el principio de la menor sorpresa, lo que significar&iacute;a  que el lenguaje deber&iacute;a comportarse de tal manera que minimizara la confusi&oacute;n  de los usuarios experimentados. Sin embargo, el propio Matz ha declarado que su  principal objetivo era hacer un lenguaje que le divirtiera a &eacute;l mismo,  minimizando el trabajo de programaci&oacute;n y la posible confusi&oacute;n, y que no aplic&oacute;  el principio de menor sorpresa al dise&ntilde;o de Ruby. </p>
          <p align="center" class="style4"><a href="https://www.crehana.com/blog/transformacion-digital/ruby-lenguaje-programacion/" target="_blank"><img src="Captura de pantalla 2024-02-03 163956.png" width="386" height="258" border="0" /></a></p>
          <p align="justify" class="style4">Sin embargo, la frase se ha  asociado al lenguaje y ha sido fuente de controversia, ya que los no iniciados  pueden suponer que las caracter&iacute;sticas de Ruby son similares a las  caracter&iacute;sticas de otros lenguajes conocidos. En <strong>mayo </strong>de <strong>2005</strong>, en una discusi&oacute;n  en el grupo de noticias comp.lang.ruby, Matz trat&oacute; de distanciar Ruby de la  mencionada filosof&iacute;a, explicando que cualquier elecci&oacute;n de dise&ntilde;o ser&aacute;  sorprendente para alguien, y que &eacute;l usa un est&aacute;ndar personal de evaluaci&oacute;n de  la sorpresa. Si ese est&aacute;ndar personal se mantiene consistente, habr&aacute; pocas  sorpresas para aquellos familiarizados con el est&aacute;ndar.</p>
          <p class="style4">Matz lo  <strong>defini&oacute;</strong> de esta manera en una entrevista:</p>
          <blockquote>
            <p align="justify" class="style5">Todo el mundo  tiene un pasado personal. Alguien puede venir de Python, otro de Perl, y pueden  verse sorprendidos por distintos aspectos del lenguaje. Entonces podr&iacute;an decir  'Estoy sorprendido por esta caracter&iacute;stica del lenguaje, as&iacute; que Ruby viola el  principio de la menor sorpresa.' Espera, espera. El principio de la menor  sorpresa no es s&oacute;lo para ti. El principio de la menor sorpresa significa el  principio de 'mi' menor sorpresa. Y significa el principio de la menor sorpresa  despu&eacute;s de que aprendes bien Ruby. Por ejemplo, fui programador de C++ antes de  empezar a dise&ntilde;ar Ruby. Program&eacute; exclusivamente en C++ durante dos o tres a&ntilde;os.  Y despu&eacute;s de dos a&ntilde;os de programar en C++, todav&iacute;a me sorprend&iacute;a.</p>
          </blockquote>
        </blockquote>
    <p class="style1">&nbsp;</p>
    <p align="justify" class="style1">&nbsp;</p>
  </blockquote>
</blockquote>
</body>
</html>
