<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Funcion || Ruby</title>
<style type="text/css">
<!--
body {
	background-color: #FBFBFB;
}
.style1 {
	font-size: 24px;
	color: #000000;
}
.style2 {
	font-size: 28px;
	color: #b22222;
	font-weight: bold;
}
-->
</style></head>

<body>
<blockquote>
  <blockquote>
    <blockquote>
      <p class="style2">Funci&oacute;n de Ruby </p>
      <p align="justify" class="style1">Ruby es un  lenguaje de programaci&oacute;n altamente flexible. La codificaci&oacute;n de desarrolladores  en Ruby puede realizar cambios en la forma en que funciona el propio idioma. Es  un lenguaje interpretado como <strong>Python</strong>, en lugar de compilado como <strong>C </strong>o<strong> C++.</strong></p>
      <p align="justify" class="style1">Pero a  diferencia de Python, que se centra en una soluci&oacute;n &uacute;nica e inequ&iacute;voca para  cada problema, los proyectos de Ruby intentan adoptar varios enfoques  diferentes para la resoluci&oacute;n de problemas. Como podr&iacute;a haber adivinado, hay  beneficios y desventajas para ambos m&eacute;todos, dependiendo de su proyecto.</p>
      <p align="justify" class="style1">Una  <strong>caracter&iacute;stica</strong> que hace que Ruby sea tan f&aacute;cil de usar es que oculta muchos  detalles del programador. Esto hace que la programaci&oacute;n con Ruby sea mucho m&aacute;s  f&aacute;cil que utilizar otros lenguajes convencionales con m&aacute;s complejidad, como C y  C++. Sin embargo, tambi&eacute;n significa que encontrar errores en el c&oacute;digo puede  ser m&aacute;s dif&iacute;cil.</p>
      <p align="justify" class="style1">Convenientemente,  el <strong>c&oacute;digo</strong> que escriba en Ruby se ejecutar&aacute; en cualquiera de los principales  sistemas operativos sin tener que ser porteado, incluidos Windows, macOS y  Linux.</p>
    </blockquote>
  </blockquote>
</blockquote>
</body>
</html>
