<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Semantica || Ruby</title>
<style type="text/css">
<!--
body {
	background-color: #FBFBFB;
}
.style1 {
	font-size: 24px;
	color: #000000;
}
.style2 {
	font-size: 28px;
	font-weight: bold;
	color: #b22222;
}
.style3 {font-size: 22px; color: #000000; font-style: italic; }
-->
</style></head>

<body>
<blockquote>
  <blockquote>
    <blockquote>
      <p align="justify" class="style2">Sem&aacute;ntica de Ruby </p>
      <p align="justify" class="style1">Ruby es  <strong>orientado a objetos:</strong> todos los tipos de datos son un objeto, incluidas las  clases y tipos que otros lenguajes definen como primitivas, (como enteros,  booleanos, y nil). Toda funci&oacute;n es un m&eacute;todo. Las variables siempre son  referencias a objetos, no los objetos mismos. Ruby soporta herencia con enlace  din&aacute;mico, mixins y m&eacute;todos singleton (pertenecientes y definidos por una sola  instancia m&aacute;s que definidos por la clase). </p>
      <p align="justify" class="style1">A pesar de que Ruby no soporta  herencia m&uacute;ltiple, la clases pueden importar m&oacute;dulos como mixins. Es compatible  con la sintaxis procedimental, pero todos los m&eacute;todos definidos fuera del  &aacute;mbito de un objeto son realmente m&eacute;todos de la clase Object. Como esta clase  es padre de todas las dem&aacute;s, los cambios son visibles para todas las clases y  objetos.</p>
      <p align="center" class="style1"><img src="Captura de pantalla 2024-02-03 162617.png" width="406" height="137" /></p>
      <p align="justify" class="style1">Ruby ha sido  descrito como un lenguaje de programaci&oacute;n <strong>multiparadigma: </strong>permite programaci&oacute;n  procedimental (definiendo funciones y variables fuera de las clases haci&eacute;ndolas  parte del objeto ra&iacute;z Object), con orientaci&oacute;n a objetos, (todo es un objeto) o  funcionalmente (tiene funciones an&oacute;nimas, clausuras y continuaciones; todas las  sentencias tienen valores, y las funciones devuelven la &uacute;ltima evaluaci&oacute;n).  Soporta introspecci&oacute;n, reflexi&oacute;n y metaprogramaci&oacute;n, adem&aacute;s de soporte para  hilos de ejecuci&oacute;n gestionados por el int&eacute;rprete. </p>
      <p align="justify" class="style1">Ruby tiene tipado din&aacute;mico, y  soporta polimorfismo de tipos (permite tratar a subclases utilizando la  interfaz de la clase padre). Ruby no requiere de polimorfismo de funciones  (sobrecarga de funciones) al ser din&aacute;micamente tipado (los par&aacute;metros de una  funci&oacute;n pueden ser de distinto tipo en cada llamada, encarg&aacute;ndose dicha funci&oacute;n  de determinar el tipo y actuar en consecuencia).</p>
      <blockquote>
        <p align="justify" class="style3">De acuerdo  con las <strong>preguntas frecuentes</strong> de Ruby, &quot;Si te gusta Perl, te gustar&aacute; Ruby y  su sintaxis. Si te gusta Smalltalk, te gustar&aacute; Ruby y su sem&aacute;ntica. Si te gusta  Python, la enorme diferencia de dise&ntilde;o entre Python y Ruby/Perl puede que te  convenza o puede que no&quot;.</p>
      </blockquote>
    </blockquote>
  </blockquote>
</blockquote>
</body>
</html>
