<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Sintaxis || Ruby</title>
<style type="text/css">
<!--
body {
	background-color: #FBFBFB;
}
.style1 {	font-size: 24px;
	color: #000000;
}
.style2 {	font-size: 28px;
	font-weight: bold;
	color: #b22222;
}
-->
</style></head>

<body>
<blockquote>
  <blockquote>
    <blockquote>
      <p align="justify" class="style2">S&iacute;ntaxis de Ruby </p>
      <p align="justify" class="style1">La sintaxis  de Ruby es similar a la de Perl o Python. La definici&oacute;n de clases y m&eacute;todos  est&aacute; definida por palabras clave. Sin embargo, en Perl, las variables no llevan  prefijos. Cuando se usa, un prefijo indica el &aacute;mbito de las variables. La mayor  diferencia con C y Perl es que las palabras clave son usadas para definir  bloques de c&oacute;digo sin llaves. Los saltos de l&iacute;nea son significativos y son  interpretados como el final de una sentencia; el punto y coma tiene el mismo  uso. A diferencia de Python, la sangr&iacute;a no es significativa.</p>
      <p align="center" class="style1"><a href="https://ed.team/cursos/ruby" target="_blank"><img src="242824114_4304096612979216_325987546744954036_n.png" width="465" height="464" border="0" /></a></p>
      <p align="justify" class="style1">Una de las  <strong>diferencias</strong> entre Ruby y Python y Perl es que Ruby mantiene todas sus variables  de instancia privadas dentro de las clases y solo la expone a trav&eacute;s de m&eacute;todos  de acceso (attr_writer, attr_reader, etc.). A diferencia de los m&eacute;todos get y  set de otros lenguajes como C++ o Java, los m&eacute;todos de acceso en Ruby pueden  ser escritos con una sola l&iacute;nea de c&oacute;digo. Como la invocaci&oacute;n de estos m&eacute;todos  no requiere el uso de par&eacute;ntesis, es trivial cambiar una variable de instancia  en una funci&oacute;n sin tocar una sola l&iacute;nea de c&oacute;digo o refactorizar dicho c&oacute;digo.  Los descriptores de propiedades de Python son similares, pero tienen una  desventaja en el proceso de desarrollo. </p>
      <p align="justify" class="style1">Si uno comienza en Python usando una  instancia de variable expuesta p&uacute;blicamente y despu&eacute;s cambia la implementaci&oacute;n  para usar una instancia de variable privada expuesta a trav&eacute;s de un descriptor  de propiedades, el c&oacute;digo interno de la clase necesitar&aacute; ser ajustado para usar  la variable privada en vez de la propiedad p&uacute;blica. Ruby elimina est&aacute; decisi&oacute;n  de dise&ntilde;o obligando a todas las variables de instancia a ser privadas, pero  tambi&eacute;n proporciona una manera sencilla de declarar m&eacute;todos set y get. Esto  mantiene el principio de que en Ruby no se puede acceder a los miembros  internos de una clase desde fuera de esta; en lugar de esto se pasa un mensaje  (se invoca un m&eacute;todo) a la clase y recibe una respuesta.</p>
    </blockquote>
  </blockquote>
</blockquote>
</body>
</html>
