<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Ventajas || Ruby</title>
<style type="text/css">
<!--
body {
	background-color: #FBFBFB;
}
.style1 {font-size: 24px;
	color: #000000;
}
.style2 {font-size: 28px;
	font-weight: bold;
	color: #b22222;
}
-->
</style></head>

<body>
<blockquote>
  <blockquote>
    <blockquote>
      <p align="justify" class="style2">Ventajas de Ruby </p>
      <p align="justify" class="style1">Seg&uacute;n el  sitio web oficial del proyecto de Ruby, el lenguaje de Ruby es un equilibrio  cuidadoso entre la programaci&oacute;n funcional y la programaci&oacute;n imperativa. Fue  dise&ntilde;ado para ser natural e intuitivo, pero no demasiado sencillo para ser  eficaz. Los fans de Ruby lo consideran <em><strong>&quot;un hermoso lenguaje  art&iacute;stico&quot;.</strong></em></p>
      <p align="justify" class="style1">M&aacute;s  espec&iacute;ficamente, Ruby es un lenguaje de secuencias de comandos dise&ntilde;ado para el  desarrollo web front-end y back-end, as&iacute; como otras aplicaciones similares. Es  un lenguaje robusto, de tipo din&aacute;mico y orientado a objetos, con una sintaxis  de alto nivel que hace que la programaci&oacute;n con &eacute;l se sienta casi como la  codificaci&oacute;n en ingl&eacute;s. De hecho, algunas personas sienten que pueden  comprender pr&aacute;cticamente el c&oacute;digo Ruby antes incluso de aprender a programar.</p>
      <p align="justify" class="style1">Ruby on  Rails, el marco web de Ruby, es uno de los marcos de desarrollo web m&aacute;s  populares en cualquier idioma. Aunque Ruby es probablemente el m&aacute;s famoso por  su uso en el desarrollo web, tambi&eacute;n tiene muchos otros usos. Algunos de ellos  incluyen automatizaci&oacute;n, herramientas de l&iacute;nea de comandos, generaci&oacute;n de  sitios est&aacute;ticos, DevOps, raspado web y procesamiento de datos.</p>
      <p align="justify" class="style1">Tal vez lo  <strong>m&aacute;s importante,</strong> Ruby es un lenguaje muy vers&aacute;til y port&aacute;til. Se puede utilizar  igual de f&aacute;cilmente en Windows, macOS, Linux e incluso en UNIX y DOS. No  importa qu&eacute; trabajo de programaci&oacute;n quieres hacer, hay una oportunidad de que  puedas hacerlo en Ruby.</p>
    </blockquote>
  </blockquote>
</blockquote>
</body>
</html>
